Courses/7140/Lectures/Languages/Java/java8-stream.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Streams of Java 8</title>
<!-- 2018-11-27 Tue 20:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2015-11-09 | <a href="../../"> ../../</a> | <a hrefTBD="index-slides.html"> Slides </a>
</div>
<div id="content">
<h1 class="title">Streams of Java 8</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
Streams of Java8.  Prereq: <a href="../Java/java8-lambda.html">Java 8 Lambda Expressions</a>, functional
interfaces and method references.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Overview</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>The streams discussed here are unrelated to <code>InputStream</code> and
<code>OutputStream</code> from Java IO.
</li>

<li>A stream is a sequence of "items".  Can be infinite.  
</li>

<li>Never expect to have the "entire" stream to be available "at once".
Typically, we use items from the head, then wish to access the
<b>next</b> item.  This is computed <b>lazily</b> (i.e., on demand).
</li>

<li>Java8 <code>stream</code> s are <b>monads</b>.  "In functional programming, a monad
is a structure that represents computations defined as sequences of
steps" &#x2013; WikiPedia.
</li>

<li>Any collection can be made into a stream. A <code>List &lt;Integer&gt; ilst =
   Arrays.asList (1, 2, 3, 5, 7, 11)</code> can be made into a stream of
those 6 integers.
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Example: An Int Stream</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
IntStream ns = ss.stream().mapToInt(s -&gt; s.length()).filter(i -&gt; i%2 != 0);
</pre>

<ol class="org-ol">
<li><code>ss</code> was a <code>List&lt;String&gt;</code>.  The <code>stream()</code> converted it to a stream.
<code>mapToInt</code> mapped each string to its length.  The filter function
removed all odd numbers from the result.  There were two uses of
the lambda expressions. (Past tense was used just to explain.)
</li>

<li>The object named <code>ns</code> will-contain/ contains the resulting stream.
</li>

<li>But, the entire stream value is not constructed "up front".  It is
computed on a need-to-have basis, known as lazy evaluation.  The
above is "just" a declaration of an object that you "want."
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Ordered Streams</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>A stream whose source is an array, a List, or a generator function,
is ordered.
</li>
<li>A stream whose source is a Set is unordered.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Map + Reduce</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>We already used the idea of a map: Apply a function to each value
of a collection and gather the resulting collection of the same
structure.
</li>

<li>Reduce is the name given to an operation that takes a collection
and computes "one-thing" out of it.
</li>

<li>Example: Sum up all the numbers of a Set.
</li>
</ol>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Example</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Example below is from <a href="https://docs.oracle.com/javase/tutorial/collections/streams/reduction.html">https://docs.oracle.com/javase/tutorial/collections/streams/reduction.html</a>
</p>
<pre class="example">
double average = roster
   .stream()
   .filter(p -&gt; p.getGender() == Person.Sex.MALE)
   .mapToInt(Person::getAge)
   .average()
   .getAsDouble();
</pre>

<ol class="org-ol">
<li><code>p -&gt; p.getGender()</code>  = =   <code>Person.Sex.MALE</code> a lambda expression as as a
true/false yielding predicate.
</li>

<li><code>mapToInt</code> is a function that applies the function given as its
argument to every item in the stream.  A new stream is constructed
with these results.
</li>

<li><code>Person::getAge</code> a lambda expression omitting the bound var of the
lambda
</li>

<li><code>average</code> is a reduction.
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Example: Log Analysis</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="../Java/src/AuthLogStreamEx.java">../Java/src/AuthLogStreamEx.java</a> Look for "Invalid" attempts to
login from the /var/log/auth.log file; 50+ lines long. A complete
Java program. <a href="../Java/src/AuthLogStreamEx.java.html">Colorized</a> | <a href="../Java/src/AuthLogStreamEx.java.2.html">Plain</a>
</li>

<li><code>% javac AuthLogStreamEx.java</code>
</li>
<li><code>% java AuthLogStreamEx auth.log.txt invalidUsers.txt</code>
</li>

<li>Input data file for the above: <a href="../Java/src/auth.log.txt">auth.log.txt</a> Copy of a
<code>/var/log/auth.log</code>.
</li>

<li>Output data file for the above: <a href="../Java/src/invalidUsers.txt">invalidUsers.txt</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="http://docs.oracle.com/javase/8/docs/api/java/util/stream/Stream.html">http://docs.oracle.com/javase/8/docs/api/java/util/stream/Stream.html</a>
   Reference.
</li>

<li>Brian Goetz, Lambdas and Streams in Java 8 Libraries, <a href="http://www.drdobbs.com/jvm/lambdas-and-streams-in-java-8-libraries/240166818">DrDobbs</a>
   article, 2014.  Recommended Reading
</li>

<li>Lectured using these <a href="https://www.cs.cmu.edu/~charlie/courses/15-214/2014-fall/slides/26-java8.pdf">PDF slides</a> by www.cs.cmu.edu/~charlie.
"Lambdas and Streams in Java8", 2014.  Required Reading.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
